# Get data

In [1]:
import pandas as pd
import numpy as np

In [7]:
pd.read_csv("education vertical dataset.csv")

      id   vertical                 FS  price
0      0  education  IT DEV Specialist     54
1      1  education  IT DEV Specialist     55
2      2  education  IT DEV Specialist     53
3      3  education  IT DEV Specialist     55
4      4  education  IT DEV Specialist     52
..   ...        ...                ...    ...
146  146  education  Pure Math teacher     21
147  147  education  Pure Math teacher     21
148  148  education  Pure Math teacher     24
149  149  education  Pure Math teacher     25
150  150  education  Pure Math teacher     22

[151 rows x 4 columns]

# Data preparation